<?php

use Illuminate\Database\Seeder;

class ActivityTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $data = [];
        for($i = 0;$i<10;$i++)
        {
            array_push($data,[
                'user_id' => '4',
                'title' => '最美校园手绘-第二届卓越杯高校手绘大赛 ',
                'content' => '全国大学生【最美校园手绘大赛】，以“弘扬校园文化，展现手绘风采”为主题，提高艺术与设计类同学手绘专业素养，展现个人手绘魅力',
                'adress' => '活动中心c276摊位',
                'status' => '0',
                'prize' => '留学奖金10000元+现金奖金3000元+作品出版书籍副主编+作品出版+证书+奖杯(1名)/留学奖金6000元+现金奖金2000元+作品出版+证书+奖杯(2名)/留学奖金4000元+现金奖金1000元+500元代金券+证书+奖杯(3名)',
                'rule' => '作品要求原创校园手绘，尺寸大小表达方式不限，临摹作品将在总分上降低20%（如100-20=80），盗用他人作品取消比赛资格/线上投 票按最终票数的百分比计分，最高分为10分/现场投 票30位专家评委，每人3票，1票为1分/线上投 票积分和专家投 票积分总和评出一等奖 1名、二等奖 2名、三等奖3名/人气奖按在线投 票排名第一位',
                'start' => '2020-11-11',
                'end' => '2021-8-22'
            ]);
        }
        DB::table('activity')->insert($data);
    }
}
